#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:cluster/ecs-fargate]
aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=kkl2hjkul9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01fff0957ca47e89f]
module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=ecs-fargate]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-029d6619b5d312fc5]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0f80f6de7b9dc4d7a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c490266581cf60ea]
aws_security_group.vpc_endpoints_security_group: Refreshing state... [id=sg-092aa043b349047b8]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a5e0f4aef71171f7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-037de480b5563395e]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-02f3a7b404fe60aef]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0055f9b92420f0255]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0445888f30e75c23f]
aws_security_group_rule.sg_egress_rule_lb_to_ecs_cluster: Refreshing state... [id=sgrule-3219608213]
aws_security_group_rule.sg_ingress_rule_ecs_cluster_from_lb: Refreshing state... [id=sgrule-1477196127]
aws_security_group_rule.sg_ingress_rule_all_to_lb: Refreshing state... [id=sgrule-545846465]
aws_security_group_rule.sg_ingress_rule_ecr_vpc_endpoint_from_ecs_cluster: Refreshing state... [id=sgrule-1371945252]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-04c743418341a2d45]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fcfdf047bb0be1b5]
aws_vpc_endpoint.cloudwatch-vpc-endpoint: Refreshing state... [id=vpce-05c85ec8f9091844d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-072b6968bf97eee88]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01895e9280a516fa5]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230111180151339500000004/ccd1a360c78d599d]
aws_vpc_endpoint.ecr-dkr-endpoint: Refreshing state... [id=vpce-03a02accb69f9d607]
aws_vpc_endpoint.ecr-api-endpoint: Refreshing state... [id=vpce-073db09604389b80a]
aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=dzo61c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.apigw_integration will be created
  + resource "aws_apigatewayv2_integration" "apigw_integration" {
      + api_id                                    = "kkl2hjkul9"
      + connection_id                             = "dzo61c"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route will be created
  + resource "aws_apigatewayv2_route" "apigw_route" {
      + api_id             = "kkl2hjkul9"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /{proxy+}"
      + target             = (known after apply)
    }

  # aws_lb_listener.ecs_alb_listener will be created
  + resource "aws_lb_listener" "ecs_alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230111180151339500000004/ccd1a360c78d599d"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment" = "dev"
          + "workload"    = "workload1"
        }
      + tags_all          = {
          + "environment" = "dev"
          + "workload"    = "workload1"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Service Unavailable"
              + status_code  = "503"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf_plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf_plan"

```

</details>

*Pusher: @liamfit, Action: `pull_request`, Workflow: `Terraform`*